LIGHT1213/esp32Wireless-Dap/backend_b/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_LWIP_LOCAL_HOSTNAME="wdap-backend-b"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_PARTITION_TABLE_TWO_OTA_LARGE=y
CONFIG_PARTITION_TABLE_FILENAME="partitions_two_ota_large.csv"
# CONFIG_WDAP_BACKEND_MOCK_SWD is not set
CONFIG_WDAP_SWD_DEFAULT_HZ=1000000
# CONFIG_WDAP_SWD_DIAG_VERBOSE is not set
CONFIG_WDAP_SWD_SWCLK_GPIO=5
CONFIG_WDAP_SWD_SWDIO_GPIO=4
CONFIG_WDAP_TARGET_NRST_GPIO=6
CONFIG_WDAP_UART_BRIDGE_PORT_NUM=1
CONFIG_WDAP_UART_BRIDGE_TX_GPIO=17
CONFIG_WDAP_UART_BRIDGE_RX_GPIO=18
CONFIG_WDAP_UART_BRIDGE_BAUDRATE=115200
CONFIG_WDAP_TARGET_RESET_SETTLE_MS=5
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_TX_BA_WIN=16
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
